In [1]:
! pip install numpy
! pip install pandas

Requirement already satisfied: numpy in c:\users\glush\miniconda3\envs\myenv\lib\site-packages (1.26.4)
Requirement already satisfied: pandas in c:\users\glush\miniconda3\envs\myenv\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.22.4 in c:\users\glush\miniconda3\envs\myenv\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\glush\miniconda3\envs\myenv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\glush\miniconda3\envs\myenv\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\glush\miniconda3\envs\myenv\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\glush\miniconda3\envs\myenv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

EXERCISE
Create series, data frame, explicitly set index.
1. Create a Series from a list
2. Create a DataFrame from a list
3. Create a DataFrame from a dictionary.
4. Create a DataFrame from a list of dictionaries.
5. Create a DataFrame from a dictionary of Series.
6. Create a DataFrame in any way you want, then set a custom index for it.
7. Change the index back to original for the DataFrame in question 6.

In [12]:
import numpy as np
import pandas as pd

#1
list1 = ['OVB', 'MRS', 'MXP', 'DUR', 'MPM', 'BNE']
s = pd.Series(list1)
s

0    OVB
1    MRS
2    MXP
3    DUR
4    MPM
5    BNE
dtype: object

In [32]:
#2
df = pd.DataFrame(list1)
df

     0
0  OVB
1  MRS
2  MXP
3  DUR
4  MPM
5  BNE

In [33]:
#3
dict1 = {
    'OVB': 88,
    'MRS': 54,
    'MXP': 120,
    'DUR': 31,
    'MPM': 48,
    'BNE': 29
}
list2 = pd.Series(dict1)
df2 = pd.DataFrame(list2, columns=['Number_of_destinations'])
df2

     Number_of_destinations
OVB                      88
MRS                      54
MXP                     120
DUR                      31
MPM                      48
BNE                      29

In [34]:
#4
data = [
    {'Name': 'Alice', 'Age': 30, 'City': 'New York'},
    {'Name': 'Antony', 'Age': 25, 'City': 'Madrid'},
    {'Name': 'Charles', 'Age': 35, 'City': 'Vladivostok'}
]

df = pd.DataFrame(data)

print(df)

      Name  Age         City
0    Alice   30     New York
1   Antony   25       Madrid
2  Charles   35  Vladivostok

In [41]:
#5
series1 = pd.Series([1, 2, 3], name='A')
series2 = pd.Series([4, 5, 6], name='B')
series3 = pd.Series([7, 8, 9], name='C')

data = {
    'OVB': series1,
    'DME': series2,
    'IKT': series3
}

df = pd.DataFrame(data)
df

   OVB  DME  IKT
0    1    4    7
1    2    5    8
2    3    6    9

In [43]:
#6
data = {
    'Name': ['Alice', 'Bob', 'Andrei', 'Elizaveta'],
    'Age': [25, 30, 22, 83],
    'City': ['New York', 'Los Angeles', 'Novosibirsk', 'Berdsk']
}

df = pd.DataFrame(data)
df.set_index('Name', inplace=True)
df

           Age         City
Name
Alice       25     New York
Bob         30  Los Angeles
Andrei      22  Novosibirsk
Elizaveta   83       Berdsk

In [48]:

list3 = [0, 1, 2, 3]
df.reset_index(inplace=True)
df

        Name  Age         City
0      Alice   25     New York
1        Bob   30  Los Angeles
2     Andrei   22  Novosibirsk
3  Elizaveta   83       Berdsk

Q1.
Read data from file ../data/data.csv to a DataFrame
Show 7 random rows from the DataFrame
Show last 3 rows of the DataFrame
Is there any missing data?
Q2.
Read data from file ../data/students.xlsx to a DataFrame, sheet Grades
Is there any missing data?
Update Machine Learning grade of student id = 4 to 3, Deep Learning grade of student id = 5 to 4
Save DataFrame to a csv file.

In [17]:
import pandas as pd

# Q1
df = pd.read_csv("data.csv")
random_rows = df.sample(n=7)
print(random_rows)
last_3_rows = df.tail(3)
print(last_3_rows)
print('There is no missing data.')

      work_year experience_level employment_type                  job_title  \
3749       2020               SE              FT  Machine Learning Engineer
1313       2023               SE              FT              Data Engineer
3470       2021               EN              FT               Data Analyst
1241       2023               SE              FT               Data Analyst
2899       2022               SE              FT               Data Analyst
410        2023               MI              FT  Machine Learning Engineer
3310       2022               SE              FT             Data Scientist

      salary salary_currency  salary_in_usd company_location company_size
3749  150000             USD         150000               US            L
1313  160000             USD         160000               US            M
3470   50000             USD          50000               US            M
1241  180000             USD         180000               US            M
2899   95000             USD          95000               US            M
410   100000             GBP         121523               GB            M
3310  120000             USD         120000               US            L
      work_year experience_level employment_type                  job_title  \
3758       2020               SE              FT       Data Science Manager
3759       2020               SE              FT  Machine Learning Engineer
3760       2020               SE              FT             Data Scientist

      salary salary_currency  salary_in_usd company_location company_size
3758  190200             USD         190200               US            M
3759   40000             EUR          45618               HR            S
3760  412000             USD         412000               US            L
There is no missing data.

In [15]:
! pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5

In [21]:
# Q2
file_path = 'students.xlsx'
sheet = 'Grades'
df = pd.read_excel(file_path, sheet_name=sheet)
print(df)
print('There is missing data.')
df.loc[df['Id'] == 4, 'Machine Learning'] = 3
df.loc[df['Id'] == 5, 'Deep Learning'] = 5
print(df)
df.to_csv('grades_upd.csv', index=False, sep=';', na_rep='N/A', header=True)

   Id  Python  Machine Learning  Deep Learning
0   1       4               5.0            3.0
1   2       5               5.0            4.0
2   3       5               5.0            5.0
3   4       5               NaN            5.0
4   5       4               4.0            NaN
5   6       3               5.0            4.0
There is missing data.
   Id  Python  Machine Learning  Deep Learning
0   1       4               5.0            3.0
1   2       5               5.0            4.0
2   3       5               5.0            5.0
3   4       5               3.0            5.0
4   5       4               4.0            5.0
5   6       3               5.0            4.0